docs/_html/usage_quiz.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="notebook-marc" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org23ec7a2" class="outline-2">
<h2 id="org23ec7a2">Overview of 'harpwise quiz'</h2>
<div class="outline-text-2" id="text-org23ec7a2">
<p>
The mode 'quiz' is a quiz on music theory, ear and memory. It is meant
as a fun way to increase your musical abilities. Quiz comes in different
flavours (see below). It issues questions and asks for answers.
</p>

<p>
All flavours offer various sorts of help, allowing to view and explore
the question at hand from a different angle.
</p>

<p>
If you invoke mode 'quiz' with the argument 'random' (or 'ran'), a
flavour is chosen at random. To try another flavour, just restart
harpwise, e.g. by pressing ctrl-z.  For a chosen flavour, different
questions of this flavour are asked in an endless loop.
</p>

<p>
There are 30 flavours of quiz
listed below; however, you do not need to memorize them, as they will be
explained on the spot when they appear.
</p>

<p>
For an overview, here are the available flavours:
</p>

<ul class="org-ul">
<li>all, ran, random:
any and all flavours, one at random</li>

<li>scales:
flavours related with scales</li>

<li>mic:
flavours, that use the microphone; most of them switch to
listen-perspective</li>

<li>no-mic:
flavours, that do not use the microphone, so that no harp is
needed; but these flavours are not necessarily silent and may
still play sounds themselves</li>

<li>silent:
flavours, that can be tried with muted speakers, although some
of the help might not be as useful</li>

<li>inters:
flavours, that revolve around intervals</li>

<li>layout:
flavours, that deal with the layout (holes to notes) of the harp</li>

<li>players:
harpwise shows details about a famous player and asks for his or
her name</li>

<li>hear-scale:
harpwise plays the holes of a scale and asks for its name</li>

<li>not-in-scale:
harpwise picks a scale at random and modifies it: holes are
shuffled and one is replaced with a foreign hole; this modified
scale is played and you should find the foreign hole. The holes
are disguised as h1, h2, and so on</li>

<li>match-scale:
plays a random sequence of holes, that are either a subset of one
or many scales and asks for the name of the single or shortest
scale containing all these holes</li>

<li>play-scale:
gives the name of a scale and asks to play it</li>

<li>hear-inter:
plays an interval and asks for its name</li>

<li>inter-song:
names an interval and ask for the mnemonic-song that starts with
this interval. Or the other way around from song to interval</li>

<li>add-inter:
gives a hole and an interval and asks for the resulting hole,
which is obtained by either adding or subtracting</li>

<li>play-inter:
names a hole and an interval which resolves to a hole; then asks
to play back both holes</li>

<li>tell-inter:
names two holes and asks for the interval between</li>

<li>hear-key:
picks a random key and its matching note (from octaves 4 or
5); plays a sequence of notes starting from this note; asks for
the key</li>

<li>hear-hole:
picks a random key and a named hole-set; then plays a hole from
this set and asks for its name</li>

<li>play-shifted:
wise computes a sequence of holes, that can be shifted by an
interval; it plays the original unshifted sequence and names and
plays the first hole of the shifted sequence; then you should play
BOTH the unshifted and shifted sequence together</li>

<li>key-harp-song:
gives a key of harmonica and asks for the matching
key of song (2nd position) or vice versa</li>

<li>hole-note:
the wise picks a harp-key then gives a hole and asks for the note
or vice versa</li>

<li>hole-note-key:
picks (and hides) a new key for the harp at random; then, for a
named hole-set (e.g. 'blow'), gives holes and matching notes
(which depend on the hidden key of harp); then asks for the key</li>

<li>hole-hide-note:
picks a new key at random and a named hole-set; then shows the
hole-set, but hides one note; then asks for the hidden note</li>

<li>hear-hole-set:
picks a new key at random and a named hole set; then plays it,
holes hidden; then asks for the key and the hole set</li>

<li>keep-tempo:
plays a number of beats defining a certain tempo; then some
silence and then some final beats. You are expected to play along
and keep the given tempo throughout; harpwise records your playing
and checks, how well you kept the tempo</li>

<li>hear-tempo:
plays a tempo and asks for its bpm</li>

<li>replay:
harpwise plays a sequence of holes and asks you to play it back</li>

<li>hear-chord:
taking the harp key as base, the wise chooses a chord (e.g. IV)
then it plays the base note as well as the chord. You are expected
to identify the chord. For difficulty HARD there are additional
chords and for some chords also variations</li>

<li>choose:
choose flavour interactively
(only as extra-argument on commandline)</li>
</ul>
</div>
</div>
<div id="outline-container-org2b42446" class="outline-2">
<h2 id="org2b42446">Usage by Examples</h2>
<div class="outline-text-2" id="text-org2b42446">
<p>
The wise chooses a quiz-flavour at random (key of c):
</p>

<div class="org-src-container">
<pre class="src src-nil">harpwise quiz c random
</pre>
</div>

<p>
this is the preferred way to get used to this mode.
</p>

<p>
To switch to a different, random mode, issue signal ctrl-z.
</p>


<p>
Some examples that choose a quiz flavour or a collection of flavours
explicitly:
</p>


<p>
Wise plays 5 notes from the scale major<sub>pentatonic</sub> for a
chromatic harmonica of key a and then asks you to play them
back (then repeat):
</p>

<div class="org-src-container">
<pre class="src src-nil">harpwise quiz chromatic a blues replay 5
</pre>
</div>

<p>
In the examples above, the type of harmonica (e.g. richter or
chromatic), the key (e.g. c or a) or the number of holes may be
omitted and are then taken from the config or defaults; so
</p>

<div class="org-src-container">
<pre class="src src-nil">harpwise q major replay
</pre>
</div>

<p>
is valid as well (but would choose a richter harp).
</p>


<p>
This example chooses the a flavour-collection:
</p>

<div class="org-src-container">
<pre class="src src-nil">harpwise quiz no-mic
</pre>
</div>

<p>
the collection 'no-mic' includes a number of different flavours, which
have in common, that they do not need your microphone and do not require
you to play your harp. This can be helpful e.g. when quizzing in public
transport.
</p>


<p>
Wise plays a scale and asks you for its name:
</p>

<div class="org-src-container">
<pre class="src src-nil">harpwise quiz hear-scale
</pre>
</div>
</div>
</div>
<div id="outline-container-org7f0c6ff" class="outline-2">
<h2 id="org7f0c6ff">Quick Start</h2>
<div class="outline-text-2" id="text-org7f0c6ff">
<div class="org-src-container">
<pre class="src src-nil">harpwise quiz ran
</pre>
</div>


<p>
And at any time, type 'ctrl-z' to try another flavour.
</p>
</div>
</div>
</div>
</body>
</html>
